---
kind: method
id: M:Autodesk.Revit.DB.SpatialElementBoundaryOptions.#ctor
source: html/0dacfb30-85f5-3eb4-d7e6-7e81dc54c7a1.htm
---
# Autodesk.Revit.DB.SpatialElementBoundaryOptions.#ctor Method

Constructs default options for calculation of the geometry of spatial elements (rooms, spaces).

## Syntax (C#)
```csharp
public SpatialElementBoundaryOptions()
```